#include <iostream>
#include <clocale>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	int a, b;
	string days[] = {"Первое ", "Второе ", "Третье ", "Четвёртое ", "Пятое ", "Шестое ", "Седьмое ", "Восьмое ", "Девятое ", "Десятое ", "Одиннадцатое ", "Двеннадацатое ", "Триннадцатое ", "Четырнадцатое ", "Пятнадцатое ", "Шестнадцатое ", "Семнадцатое ", "Восемнадцатое ", "Девятнадцатое ", "Двадцатое ", "Двадцать первое ", "Двадцать второе ", "Двадцать третье", "Двадцать четвёртое", "Двадцать пятое", "Двадцать шестое", "Двадцать седьмое ", "Двадцать восьмое ", "Двадцать девятое ", "Тридцатое ", "Тридцать первое "};
	string month[] = { "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря" };
	cout << "Введите номер дня \n";
	cin >> a;
	cout << "Введите номер месяца \n";
	cin >> b;
	cout << days[a - 1] << month[b - 1];
	return 0;
}